04 - desafios/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "gender", "rate", "Description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "jogo da velha"], ["gender", "acao"], ["rate", 0.9], ["Description", "jogo da velha "], ["created_at", "2023-03-15 18:09:09.001403"], ["updated_at", "2023-03-15 18:09:09.001403"]]

  def destroy
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]

    def set_article
      @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]